05_express_metrics/artillery/test.yaml
config:
  target: "http://0.0.0.0:8000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load
  variables:
    waits:
      - 10000
      - 3000
      - 1000
      - 60
      - 50
      - 2
      - 0

    errors:
      - 200
      - 301
      - 302
      - 400
      - 404
      - 501
      - 502
      - 503

    fetch_count:
      - 1
      - 2
      - 3
      - 4
      - 5
      - 6
      - 7

scenarios:
  - name: "root"
    flow:
      - get:
          url: "/"

  - name: "ping"
    flow:
      - get:
          url: "/ping"

  - name: "sleep"
    flow:
      - get:
          url: "/sleep?wait={{ waits }}"

  - name: "error"
    flow:
      - get:
          url: "/error?error={{ errors }}"

  - name: "fetch"
    flow:
      - get:
          url: "/fetch?count={{ fetch_count }}"